Repository: giellalt/corpus-smj
Catalog: tmx/sma/admin/depts/other_files/laereplan_engelsk.html.tmx
Source language: smj
Languages: sma

source: Digitála tjehpudagá merkaj åvddånahttet máhtov ja persåvnnåsuodjalimev gálldovuosedimij baktu majt maŋenagi dåhkki guoradallat.
sma: Digitaale tjiehpiesvoeth lea daajroem evtiedidh aalkoereaktan jïh almetjevaarjelimmien bïjre viehkine gaaltijevuesiehtimmijste mejtie gåarede gïehtjedidh.

source: Máhtudakmihto 2. jahkedáse maŋŋela
sma: Maahtoeulmieh 2. daltesen mænngan

source: Åhpadusá mihttomierre le oahppe galggá máhttet
sma: Lohkehtimmien ulmieh leah; learohkh gelkieh

source: buktet buojkulvisájt muhtem dilijda gånne le ávkálasj ieŋŋiskgielav máhttet
sma: såemies vuesiehtimmieh vedtedh gåessie maahta nuhteligs årrodh eengelskem maehtedh

source: gávnnat bágojt ja moallánahkkojt ma li aktisattja ieŋŋilsgielan ja ietjat iednegielan
sma: baakoeh jïh lahtesh gaavnedh mah leah tjåenghkies eengelsken gïelese jïh jïjtse ietniengïelese

source: adnet digitala ressursajt gå le gielav oahppamin
sma: digitaale vierhtieh nuhtjedh juktie gïelem dååjredh

source: gulldalit ja adnet ieŋŋilsgiela giellajienajt praktisk-estetalasj åvddånbuktemvuogij baktu
sma: goltelidh jïh eengelske gïeletjoejh nuhtjedh praktihkeles-estetihkeles soptsestimmievuekiej tjirrh

source: gulldalit ja dádjadit álkkes bagádallamijt ieŋŋilsgiellaj
sma: goltelidh jïh guarkedh aelhkie bïhkedassh eengelsken gïelesne

source: gulldalit ja dádjadit bágojt ja moallánahkkojt ieŋŋilsgielak rijmajn, gáritjijn, lávllagijn ja subttsasijn
sma: goltelidh jïh baakoeh jïh lahtesh guarkedh eengelskegïelen rijmine, raajrojne, laavloeminie, heamturinie jïh soptsesinie

source: dádjadit ja adnet ieŋŋilsgielak bágojt, moallánahkkojt ja gárgadisájt lahka birrusijs ja ietjas berustimes
sma: guarkedh jïh naan eengelske baakoeh, lahtesh jïh raajesemaallh nuhtjedh, gietskies byjreski jïh jïjtse ïedtji bïjre

source: buorástahttet, gátjádit ja vásstedit álkkes gatjálvisájt ja adnet muhtem vættsásvuoda moallánahkkojt
sma: healsoehtidh, gihtjedh jïh vaestiedidh aelhkie gyhtjelassh jïh naan dåajmijes lahtesh nuhtjedh

source: oassálasstet álkkes guládallamijda ja ságastallamijda lahka birrusijs ja ietjas åtsådallamijs
sma: meatan årrodh dijalogine mejtie haarjanamme jiehtedh, jïh faahketji soptsestimmine gietskies byjreski jïh jïjtse dååjresi bïjre

source: adnet tállajt gå le ságastallamin lahka birrusa ja ietjas åtsådallamij birra
sma: taalh nuhtjedh gosse lïhke byjreski bïjre jïh jïjtse dååjresi bïjre soptseste

source: dåbddåt aktijvuodav ieŋŋilsgielak giellajienaj ja stávimvuoge gaskan
sma: ektiedimmiem damtijidh gaskem naan eengelsken gïeletjoejh jïh staavadimmiemaallh

source: gæhttjaladdat låhkat ja tjállet ieŋŋilsgielak bágojt, moallánahkkojt ja álkkes gárgadisájt lahka birrusijs ja ietjas berustimes
sma: eksperimenteradidh lohkedh jïh tjaeledh eengelske baakoeh, lahtesh jïh aelhkie raajesh mah leah gietskies byjreski jïh jïjtse ïedtji bïjre

source: ságastallat mánáj bæjválasj iellema birra ieŋŋilsgielak rijkajn
sma: soptsestidh guktie maanaj aarkebiejjie lea eengelskegïelen laantine

source: oasev válldet ja åtsådallat mánájkultuvrav ieŋŋilsgielak rijkajs bágoj, gåvåj, musihka ja labudallama baktu
sma: meatan årrodh jïh maanakultuvrem dååjredh eengelskegïelen laantijste viehkine baakoeh, guvvieh, musihkem nuhtjedh jïh svihtjedh

source: giehttot ietjas åtsådallamijt ieŋŋilsgielak rijmajs, gáritjijs, lávllagijs ja subttsasijs
sma: jïjtsh dååjresh soptsestidh eengelskegïelen rijmijste, raajrojste, laavloemijstie, heamturijstie jïh soptsesijstie

source: Máhtudakmihto 4. jahkedáse maŋŋela
sma: Maahtoeulmieh 4. daltesen mænngan

source: identifiserit dilijt gånne le ávkálasj jali dárbulasj ieŋŋilsgielav máhttet
sma: daejredh gåessie maahta nuhteligs jallh daerpies eengelskem maehtedh

source: ságastallat gåktu iesj ieŋŋilsgielav oahppá
sma: soptsestidh guktie satne barka eengelskem lïeredh

source: gávnnat bágojt ja moallánahkkojt ma li muodugattja ieŋŋilsgielan ja ietjas iednegielan
sma: hedtieh gaavnedh baakoej jïh lahtestimmievuekiej gaskem eengelsken gïelesne jïh jïjtse ietniengïelesne

source: adnet digitále ressursajt ja ietjá viehkkenævojt gå le gielav guoradallamin
sma: digitaale vierhtieh jïh jeatjah viehkiedïrregh nuhtjedh gïelegoerehtimmesne

source: adnet álkkes gulldalim- ja hållamstrategijajt
sma: aelhkie goltelimmie- jïh soptsestimmievuekieh nuhtjedh

source: gulldalit ja dádjadit bágoj ja moallánahkkoj sisanov aktijvuodas gånna aneduvvi
sma: goltelidh jïh guarkedh baakoej jïh lahtesi mïelem dehtie ektiedimmeste gusnie dah leah åtnasovveme

source: dádjadit ja adnet ieŋŋilsgiela bágojt, moallánahkkojt ja gárgadisájt tjanádum ietjas dárbojda ja dåbdojda, bæjválasj iellemij, friddjaájggáj ja berustimijda
sma: guarkedh jïh nuhtjedh eengelske baakoeh, lahtesh jïh raajesemaallh mah leah ektiedamme jïjtse daerpiesvoetide jïh domtesidie, aarkebeajjan, eejehtallemasse jïh ïedtjide

source: dádjadit oajvvesisanov rijmajn, gáritjijn, lávllagijn ja subttsasijn
sma: åejviesisvegem guarkedh rijmine, raajrojne, laavloeminie, heamturinie jïh soptsesinie

source: adnet muhtem vættsásvuoda moallánahkkojt ja frásajt viehkken dádjadittjat ja dádjaduvátjit
sma: såemies dåajmijes lahtesh jïh aelhkie jiehtegh nuhtjedh juktie viehkiem åadtjodh guarkedh jïh guarkeme sjïdtedh

source: oasev válldet bæjválasj ságastallamijs lahkabirrusijs ja ietjas åtsådallamijs
sma: meatan årrodh aarkebiejjien soptsestimmine gietskies byjreski jïh jïjtse dååjresi bïjre

source: oahppat ieŋŋilsgiela alfabehtav ja stávut namájt ja årromsajij namájt
sma: dam eengelske aalfabetem jiehtedh jïh nommh jïh sijjienommh staavadidh

source: dádjadit ja adnet bágojt ja moallánahkkojt hattij birra, ednakvuoda, hámij ja stuorrudagáj birra gå le guládallamin bæjválasj iellema, friddjaájge ja berustimij birra
sma: guarkedh jïh nuhtjedh baakoeh mah leah ektiedamme åaside, veahkide, hammojde jïh stoeredahkide gosse aarkebiejjien, eejehtallemen jïh ïedtji bïjre soptseste

source: adnet álkkes låkåm- ja tjállemstrategijajt
sma: aelhkie lohkeme- jïh tjaelemevuekieh nuhtjedh

source: dádjadit aktijvuodav ieŋŋilsgiela giellajienaj ja bokstávaj gaskan ja dahkat jienajs bágojt
sma: ektiedimmiem guarkedh eengelske gïeletjoeji jïh bokstaavi gaskem, jïh tjoejh tjåanghkan giesedh baakose

source: dádjadit bágoj ja moallánahkko sisanov dat aktijvuodas gånnå aneduvvá
sma: mïelem baakojste jïh lahtesijstie guarkedh dehtie ektiedimmeste gusnie dah leah åtnasovveme

source: låhkåt, dádjadit ja tjállet ieŋŋilsgiela bágojt ja moallánahkkojt ietjas dárbojda ja dåbdojda, bæjválasj iellemij, friddjaájgijda ja berustimijda
sma: eengelske baakoeh jïh lahtesh lohkedh, guarkedh jïh tjaeledh mah leah ektiedamme jïjtse daerpiesvoetide jïh domtesidie, aarkebeajjan, eejehtallemasse jïh ïedtjide

source: dádjadit oajvvesisanov álkkes tevstajs ja oahpes ássjijs
sma: åejviesisvegem guarkedh aelhkie tjaaleginie åehpies aamhtesi bïjre

source: tjállet oanes tevstajt maj ájádusájt ja berustimijt gåvvi, ja ma tjielggiji, subtsasti ja mai gatjádallá
sma: åenehks tjaalegh tjaeledh mïeli jïh ïedtji bïjre, jïh mah buerkiestieh, gihtjieh jïh vaestiedieh

source: adnet muhtem dábálasj smávep bágojt ja álkkes stávim- ja gárgadishámijt
sma: naan sïejhme smaavebaakoeh nuhtjedh jïh aelhkie staavadimmie- jïh raajesemaallh

source: adnet digitála vædtsagijt gå viedtjá diedojt ja gæhttjaladdat tevstajt dahkat
sma: digitaale dïrregh nuhtjedh juktie bïevnesh ribledh jïh eksperimenteradidh tjaalegem sjugniedidh

source: vaddet muhtem buojkulvisájt ieŋŋilsgielak rijkajda ja dåbdos ulmutjijda dajs rijkajs
sma: såemies vuesiehtimmieh vedtedh eengelskegïelen laantine jïh åehpies almetjh debpede

source: ságastallat viessomvuogij, dábij birra ieŋŋilsgielak rijkajn ja Vuona rijkan
sma: soptsestidh såemies bieliej bïjre ovmessie jieledevuekijste, aerpievuekijste jïh skihkijste eengelskegïelen laantine jïh Nöörjesne

source: oasev válldet åvddånbuktemijs ieŋŋilsgielak rijmajs, gáritjijs, lávllagijs ja oanes oavdástallamijs ja subttsasijs
sma: meatan årrodh eengelskegïelen rijmh, raajroeh, laavlomh, åenehks teaterestuhtjh jïh soptsesh åehpiedehtedh

source: giehttot ietjas ájádusáj ja vuojnoj birra gå le ieŋŋilsgielak girjálasjvuodajn ja mánájkultuvrajn barggamin
sma: jïjtse åssjaldahkh jïh mïelh buektedh gosse åehpies sjædta eengelskegïelen lidteratuvrine jïh maanakultuvrine

source: tjállet ietjas tevstajt ma li bájnnum ieŋŋilsgielak girjálasjvuodas ja mánájkultuvras
sma: jïjtse tjaalegh darjodh mah leah skreejreme eengelskegïelen lidteratuvreste jïh maanakultuvreste

source: identifiserit ja adnet duov dáv dilev ja oahppamstrategijav åvdedittjat ietjas ieŋŋelskgielak tjehpudagáv
sma: damtijidh jïh ovmessie tsiehkieh jïh lïerehtimmievuekieh nuhtjedh juktie jïjtse tjiehpiesvoeth eengelsken gïelesne vijriedidh

source: gåvådit ja tjielggit ietjas bargov gå le ieŋŋilskgielav oahppamin
sma: soptsestidh guktie satne barka eengelskem lïeredh

source: identifiserit mij le ja mij ij le gielalattjat muoduk ieŋŋelskgiela ja ietjas iednegiela gaskan
sma: naan gïelen hedtieh jïh joekehtsh damtijidh eengelsken jïh jïjtse ietniengïelen gaskem

source: adnet digitála ressursajt ja ietjá viehkkenævojt ietjas giellaåhpadusán
sma: digitaale vierhtieh jïh jeatjah viehkiedïrregh nuhtjedh jïjtse gïelelïerehtimmesne

source: adnet gulldalim- ja hållamstrategijajt
sma: goltelimmie- jïh soptsestimmievuekieh nuhtjedh

source: dádjadit ja adnet báhkoboanndudagáv tjanádum oahpes ássjijda
sma: baakoeveahkam guarkedh jïh nuhtjedh åehpies aamhtesi bïjre

source: dádjadit oajvvesisanov njálmálasj tevstajs ma li tjanádum oahpes ássjijda
sma: åejviesisvegem njaalmeldh tjaaleginie guarkedh åehpies aamhtesi bïjre

source: adnet vættsásvuoda moallánahkkojt ja moallánahkkojt ma geŋga dilláj gullu
sma: dåajmijes lahtesh nuhtjedh jïh lahtesh mah leah tseahkan sjïehtedamme

source: moalgget vaj viehkev oadtju dádjadittjat ja dádjaduvátjit duon dán dilen
sma: soptsestidh juktie viehkiem åadtjodh guarkedh jïh guarkeme sjïdtedh ovmessie tsiehkine

source: moalgget ja tjielggit ietjas vuojnojt oahpes ássjij gáktuj
sma: jïjtse mïelem soptsestidh jïh buerkiestidh åehpies aamhtesi bïjre

source: álgadit, ságastallat ja låhpadit ságastallamav tjanádum oahpes dilijda
sma: aelkedh, steeredh jïh soptsestimmieh orrijidh mah leah åehpies tsiehkiej bïjre

source: adnet vuodo hámijt gå moalget, jiednat, bágojt såjåt ja gárgadisájt dahká guládaládijn
sma: vihkeles maallh nuhtjedh baakoestæmman, intonasjovnese, baakoesojjehtæmman jïh raajesesåarhtide govlesadtemisnie

source: moalgget álkkes merustallamij birra, ja valuta ja mihttimavtadagáj birra gå le guládallamin bæjválasj dilen
sma: soptsestidh aelhkie aerviedimmiej, valutan jïh möölegeektievoeti bïjre gosse aarkebiejjien tsiehkiej bïjre soptseste

source: adnet låhkåm- ja tjállemstrategijajt
sma: lohkeme-jïh tjaelemevuekieh nuhtjedh

source: dádjadit ja adnet báhkoboanndudagáv oahpes ássjij hárráj
sma: baakoeveahkam guarkedh jïh nuhtjedh åehpies aamhtesi bïjre

source: dádjadit oajvvesisanov iesjválljidum tevstajn
sma: åejviesisvegem guarkedh jïjtjeveeljeme tjaaleginie

source: låhkåt ja dádjadit duov dáv tevstav duot dát stuorrudagás moattet gáldos
sma: ovmessie såarhts tjaalegh lohkedh jïh guarkedh ovmessie gaaltijijstie

source: tjállet notáhtajt majna ådå tevstajt dahká
sma: notaath vaeltedh juktie ovmessie såarhts tjaalegh darjodh

source: tjállet avtatraják tevstajt ma subtsasti, mujttali, gåvådi åtsådallamijt ja ietjas vuojnojt ja ájádusájt tjielggiji
sma: galkije tjaalegh tjaeledh mah buerkiestieh, vaajestieh, dååjresh buerkiestieh jïh jïjtse mïelh buektieh

source: adnet vuodulasj hámev duollatjállemis, báhkosåjådimes, gárgadis- ja tækstadahkamis gå le tevstajt tjállemin
sma: vihkeles maallh nuhtjedh reaktatjaeliemasse, baakoesojjehtæmman, raajese- jïh tjaalegebigkemasse gosse tjaalegh dorje

source: adnet digitála vædtsagijt ja ietjá viehkkenævojt gå le guoskavasj diedojt åhtsåmin ja duov dáv tevstav dahkamin
sma: digitaale dïrregh jïh jeatjah viehkiedïrregh nuhtjedh juktie sjyöhtehke bïevnesh gaavnedh jïh ovmessie såarhts tjaalegh darjodh

source: subtsastit ulmutjij, bájkij ja dáhpádusáj birra ieŋŋilskgielak rijkajs
sma: almetji, sijjiej jïh heannadimmiej bïjre soptsestidh eengelskegïelen laantijste

source: ságastallat viessomvuogij ja sæbrástallamvuogij birra duon dán kultuvran ieŋŋelskgielak rijkajn ja Vuona rijkan, ja aj sáme kultuvran
sma: jieledevuekiej bïjre soptsestidh jïh guktie almetjh ektesne årroeh ovmessie kultuvrine eengelskegïelen laantine jïh Nöörjesne, dej gaskem saemien kultuvre

source: låhkåt ieŋŋelskgielak mánáj- ja nuorajgirjálasjvuodav ja ságastallat persåvnåj ja sisano birra
sma: eengelskegïelen maana-jïh noerelidteratuvrem lohkedh jïh almetji jïh sisvegen bïjre soptsestidh

source: buktet ietjas dåbdojt ieŋŋgilskgielak girjálasj tevstaj hárráj, filmaj, næhttakultuvra, gåvåj ja musihka hárraj
sma: jïjtse reaksjovnh buektedh eengelskegïelen lidteræære tjaalegidie, filmide, nedtekultuvrese, guvvide jïh musihkese

source: moalgget ja åvddånbuktet kreatijvalattjat arvusmahtedum moattelágásj ieŋŋelskgielak girjálasj tevstajt moattet gáldos
sma: skaepiedihkslaakan soptsestidh viehkine skraejrijste ovmessie såarhts eengelskegïelen lidteræære tjaalegijstie ovmessie gaaltijijstie

source: gaskostit oanep tevstajt iesjválljidum ássjijs
sma: åenehks tjaalegh åehpiedehtedh jïjtjeveeljeme aamhtesi bïjre

source: Máhtudakmihto 10. jahkedáse maŋŋela
sma: Maahtoeulmieh 10. daltesen mænngan

source: adnet duov dáv dilev, barggovuogev ja oahppamstrategijav majna åvdedit ietjas tjehpudagáv ieŋŋelskgielan
sma: ovmessie tsiehkieh, barkoevuekieh jïh lïerehtimmievuekieh nuhtjedh juktie jïjtse tjiehpiesvoeth evtiedidh eengelsken gïelesne

source: kommenterit ietjas bargov gå le ieŋŋelskgielav oahppamin
sma: soptsestidh guktie satne barka eengelskem lïeredh

source: identifiserit dav mij le muoduk ja mij ij le muoduk ieŋŋelskgielan ja ietjas iednegielan, ja adnet dav gå le gielav oahppamin
sma: stoerre gïelehedtieh jïh gïelejoekehtsh damtijidh eengelsken jïh jïjtse ietniengïelen gaskem, jïh dejtie jïjtse gïelelïerehtimmesne nuhtjedh

source: válljit duov dáv digitála ressursav ja ietjá viehkkenævov, ja adnat dajt iesjrádálattjat gå gielav le oahppamin
sma: ovmessie digitaale vierhtieh jïh jeatjah viehkiedïrregh veeljedh, jïh dejtie jïjtjeraarehke nuhtjedh jïjtse gïelelïerehtimmesne

source: válljit ja adnet duov dáv gulldalim- ja hållamstrategijav hiebaduvvam ulmmáj
sma: veeljedh jïh nuhtjedh ovmessie goltelimmie- jïh soptsestimmievuekieh mah leah åssjelasse sjïehtedamme

source: dádjadit ja adnet dábálasj báhkoboanndudagáv tjanádum duon dán ássjáj
sma: aktem sïejhme baakoeveahkam guarkedh jïh nuhtjedh ovmessie aamhtesi bïjre

source: máhttet sieradit positijvalasj ja negatijvalasj moalgedimij gaskav ma vuosedi ájnegisulmutjijda ja ja juohkusijda
sma: maehtelesvoetem vuesiehtidh positijve jïh negatijve lahtesi gaskem joekehtidh mah aktegsalmetjidie jïh almetjedåehkide tjuvtjiedieh

source: dádjadit oajvvesisanov ja detáljajt duot dát njálmálasj tevstas ma guosski duon dán ássjáj
sma: åejviesisvegem jïh sjïere biehkieh guarkedh ovmessie såarhts njaalmeldh tjaaleginie ovmessie aamhtesi bïjre

source: gulldalit ja dádjadit variántajt ieŋŋilskgielas moattet autentalasj diles
sma: goltelidh jïh guarkedh jeereldihkie eengelske gïelh ovmessie rïektes tsiehkijste

source: adnet gielav duolla ja avtatbirges hiebadum ulmmáj ja dilláj
sma: galkije jïh ektiedimmine soptsestidh mij lea åssjelasse jïh tseahkan sjïehtedamme

source: moalgget ja tjielggit ietjas vuojnojt duon dán ássje hárráj
sma: jïjtse mïelem buektedh jïh buerkiestidh ovmessie aamhtesi bïjre

source: álgadit, jådedit ja låhpadit ságastallamijt duon dán ássjen gatjádallama baktu ja gåtsedit tjuojggidusájt
sma: aelkedh, steeredh jïh galhkedh soptsestimmieh ovmessie aamhtesi bïjre viehkine gyhtjelassh gihtjedh, jïh jåerhkedh aamhtesi bïjre soptsestidh mejtie mubpieh aalkeme

source: adnet guovdásj gåvvusav jiednadime hárráj, intonasjåvnå, báhkosåjådime ja duon dán lágásj gárgadisáj hárráj guládallamin
sma: vihkeles maallh nuhtjedh baakoestæmman, intonasjovnese, baakoesojjehtæmman jïh ovmessie raajesesåarhth govlesadtemisnie

source: válljit ja adnet duov dáv låhkåm- ja tjállemstrategijav mij le ulmmáj hiebadum
sma: veeljedh jïh nuhtjedh ovmessie lohkeme- jïh tjaelemevuekieh sjïehtedamme åssjelasse

source: dádjadit ja adnet dábálasj báhkoboanndudagáv duon dán ássje hárráj
sma: aktem sïejhme baakoeveahkam guarkedh jïh nuhtjedh ovmessie aamhtesi bïjre

source: máhttet sieradit positijvalasj ja negatijvalasj moalgedimijt ma vuosedi ájnegisulmutjijda ja juohkusijda
sma: maehtelesvoetem vuesiehtidh positijve jïh negatijve lahtesi gaskem mah leah aktegsalmetji jïh almetjedåehkiej bïjre

source: dádjadit oajvvesisanov ja detáljajt iesjválljidum tevstajn
sma: åejviesisvegem jïh sjïere aath guarkedh jïjtjeveeljeme tjaaleginie

source: låhkåt, dádjadit ja árvustallat moattelágásj tevstav duot dát ássjes
sma: ovmessie såarhts guhkies jïh åenehks tjaalegh lohkedh, guarkedh jïh vuarjasjidh, ovmessie aamhtesi bïjre

source: adnet ietjas notáhtajt ja duov dáv gáldov vuodon tjállemij
sma: jïjtsh notaath jïh ovmessie gaaltijh nuhtjedh goh våarome tjaeliemasse

source: tjállet duov dáv tevstav mij le avtarájak ja struktuvrajn
sma: ovmessie såarhts tjaalegh tjaeledh struktuvrine jïh ektiedimmine

source: adnet guovdásj gåvvusav duollatjállema hárráj, báhkosåjådime, gárgadis- ja tækstadahkama hárráj gå le tevstajt buvtadime
sma: vihkeles maallh nuhtjedh reaktoetjaeliemasse, baakoesojjehtæmman, raajese- jïh tjaalegebigkemasse gosse tjaalegh dorje

source: diehtet persåvnnåsuodjalime ja dahkkerievtesvuoda birra ja válljit ja adnet sisanov moattelágásj gáldojs dan láhkáj vaj le máhttelis dárkestit gáldojt maŋŋela
sma: digitaale dïrregh jïh hammoekrïevenassh nuhtedh bïevnesegïetedæmman, tjaalegedorjemasse jïh govlesadtemasse

source: ságastallat viessomvuogij ja sæbrástallamvuogij birra Sorbritannian, USAan, ja ietjá ieŋŋilskgielak rijkajn ja Vuonan
sma: jieledevuekieh digkiedidh jïh guktie almetjh leah ektesne Stoerre-Britannijesne, jeatjah eengelskegïelen laantine jïh Nöörjesne

source: tjielggit histåvrå ja geografija åsijt Storbritannian ja USAan
sma: sjïere væhtah buerkiestidh histovrijen jïh geografijen bïjre Stoerre-Britannijesne jïh USA:sne

source: ságastallat duon dán ieŋŋilskgielak girjálasj tevstaj birra ieŋŋilskgielak rijkajs
sma: ovmessie såarhts eengelskegïelen lidteræære tjaalegh digkiedidh eengelskegïelen laantijste

source: gåvådit ja ájádallat iemeálmmugij dilev ieŋŋilskgielak rijkajn
sma: buerkiestidh jïh ussjedidh tsiehkien bïjre aalkoealmetjidie eengelskegïelen laantine

source: dahkat, gaskostit ja ságastallat ietjas tevstaj birra ma li arvusmahtedum ieŋŋilskgielak girjálasjvuodas, filmajs ja kultuvralasj åvddånbuktemvuogijs
sma: darjodh, leerehtidh jïh soptsestidh jïjtse tjaalegi bïjre mejtie skraejriem åådtjeme eengelskegïelen lidteratuvreste, filmeste jïh kultuvrelle lahtestimmievuekijste

source: ságastallat ja gaskostit ájggeguovddelis ja fágalasj ássjij birra
sma: sjyöhtehke jïh faageles aamhtesi bïjre soptsestidh jïh dejtie leerehtidh

source: Máhtudakmihto Jo1 – oahppogárvedime åhpadusprográmma maŋŋel ja Jo2 – viddnofágalasj åhpadusprográmma maŋŋel
sma: Maahtoeulmieh Jåa2 mænngan – barkoefaageles ööhpehtimmieprogrammh

source: árvustallat ja adnet duov dáv dilev, barggovuogev ja oahppamstrategijav gå le åvdedime ietjas tjehpudagáv ieŋŋilskgielan
sma: ovmessie tsiehkieh, barkoevuekieh jïh lïerehtimmievuekieh vuarjasjidh jïh nuhtjedh, juktie jïjtse tjiehpiesvoeth eengelsken gïelesne vijriesåbpoe evtiedidh

source: árvustallat ietjas åvddånimev gå le ieŋŋilskgielav oahppamin
sma: jïjtse evtiedimmiem vuarjasjidh eengelskelïereminie

source: árvustallat duov dáv digitála ressursav ja ietjá viehkkenævojt lájttalisát ja iesjrádálattjat, ja adnet dajt gå iesj le gielav oahppamin
sma: ovmessie digitaale vierhtieh jïh jeatjah viehkiedïrregh laejhtehkslaakan jïh jïjtjeraarehke vuarjasjidh, jïh dejtie jïjtse gïelelïerehtimmesne nuhtjedh

source: árvustallat ja adnet hiebalgis gulldalim- ja hållamstrategijajt hiebadum ulmmáj ja dilláj
sma: sjiehteles goltelimmie- jïh soptsestimmievuekieh vuarjasjidh jïh nuhtjedh mah leah åssjelasse jïh tseahkan ektiedamme

source: dádjadit ja adnet vijdes dábálasj báhkoboanndudagáv ja fágalasj báhkoboanndudagáv mij le tjanádum ietjas åhpadusprográmmaj
sma: guarkedh jïh nuhtjedh aktem gamte sïejhme baakoeveahkam jïh aktem faageles baakoeveahkam mah leah jïjtse ööhpehtimmieprogrammese ektiedamme

source: dádjadit oajvvesisanov ja detáljajt duot dát njálmálasj tevstas dábálasj ássjijn ja ássjijn ietjas åhpadusprográmmas
sma: åejviesisvegem jïh sjïere aath guarkedh ovmessie såarhts njaalmeldh tjaaleginie sïejhme jïh faageles aamhtesi bïjre, ektiedamme jïjtse ööhpehtimmieprogrammese

source: gulldalit ja dádjadit sosialalasj ja geografalasj variántajt autentalasj diles
sma: sosijaale jïh geografeles jeerehtsh eengelsken gïeleste goltelidh jïh guarkedh rïektes tsiehkijste

source: adnet gielav moatten dilen duolla ja avtatbirges, hiebadum ulmmáj ja dilláj
sma: jeereldihkie jïh veelelaakan soptsestidh galkije jïh ektiedimmine, sjïehtedamme åssjelasse jïh tseahkan

source: álgadit, jådedit ja låhpadit ságastallamijt dábálasj ássjij ja fágalasj ássjij birra ietjas åhpadusprográmmas
sma: aelkedh, steeredh jïh galhkedh soptsestimmieh jïh digkiedimmieh sïejhme jïh faageles aamhtesi bïjre, ektiedamme jïjtse ööhpehtimmieprogrammese

source: adnet gåvvusav jiednadime hárráj, intonasjåvnå, báhkosåjådime ja duon dán lágásj gárgadisáj hárráj gå le guládallamin
sma: maallh baakoestæmman, intonasjovnem, baakoesojjehtæmman nuhtjedh jïh jeereldihkie raajesesåarhth govlesadtemisnie

source: dålkkut ja adnet teknihkalasj ja matematihkalasj diedojt guládallamijn
sma: toelhkestidh jïh teknihkeles jïh matematihkeles bïevnesh nuhtjedh govlesadtemisnie

source: árvustallat ja adnet hiebalgis låhkåm- ja tjállemstrategijajt hiebadum ulmmáj ja tækstahábmáj
sma: vuarjasjidh jïh nuhtjedh sjiehteles lohkeme- jïh tjaelemevuekieh, ektiedamme åssjelasse jïh tjaalegesåarhtese

source: árvustallat duov dáv gáldov ja adnet gáldoj sisanov iesjrádálasj, lájttális ja guoradallam máhttelisvuogij milta
sma: aktem gamte sïejhme baakoeveahkam jïh faageles baakoeveahkam guarkedh jïh nuhtjedh, ektiedamme jïjtse ööhpehtimmieprogrammese

source: dádjadit oajvvesisanov ja detáljajt tevstajs vijdes sisanujn duot dát ássjes
sma: lohkedh juktie faagedaajroeh vejtiestidh jïjtse ööhpehtimmieprogrammeste

source: låhkåt ja åmastit fáhkamáhtov ietjas åhpadusprográmmas
sma: jïjtsh notaath darjodh juktie tjaalegh tjaeledh mah ektiedimmiem utnieh jïjtse ööhpehtimmieprogrammese

source: adnet ietjas notáhtajt gå le tevstaj tjállemin ma gulluji ietjas åhpadusprográmmaj
sma: ovmessie såarhts tjaalegh tjaeledh struktuvrine jïh ektiedimmine, sjïehtedamme åssjelasse jïh tseahkan

source: tjállet duov dáv avtarájak tevstav struktuvrajn, hiebadum ulmmaj ja dilláj
sma: maallh reaktoetjaeliemasse, baakoesojjehtæmman jïh jeereldihkie raajese- jïh tjaalegebigkemasse nuhtjedh gosse tjaalegh dorje

source: adnet guovdásj gåvvusav duollatjállema, báhkosåjådime ja duon dán lágásj gárgadisáj hárráj gå le tevstajt buvtadime
sma: ovmessie såarhts tjaalegh darjodh sjïehtedamme digitaale hammoekrïevenasside, ovmessie digitaale meedijinie

source: buvtadit duov dáv tevstav hiebadum digitála hábmegájbbádussaj duon dán digitála midijájn
sma: ovmessie gaaltijh vuarjasjidh jïh sisvegem gaaltijijstie jïjtjeraarehke jïh laejhtehkslaakan nuhtjedh, jïh naemhtie guktie gåarede gaaltijidie gaavnedh

source: ságastallat kultuvra ja sebrudakdilij birra moatten ieŋŋilskgielak rijkan
sma: kultuvrem jïh siebriedahketsiehkiem digkiedidh jieniebinie eengelskegïelen laantine
